; domain
(define (domain blocks)
  (:requirements :strips :equality :disjunctive-preconditions :derived-predicates :negative-preconditions :conditional-effects :existential-preconditions :typing)

  (:types
    robot block - object
  )

  (:predicates 
    (on ?block1 - block ?block2 - block)
    (ontable ?block - block)
    (clear ?block - block)
    (KBquery_fullHands ?robot - robot)
    (holding ?robot - robot ?block - block)
  )

  (:action pick-up
    :parameters (?robot - robot ?block - block)
    :precondition (and 
      (clear ?block) 
      (ontable ?block) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (not (ontable ?block))
        (not (clear ?block))
        (holding ?robot ?block)
      )
  )

  (:action put-down
    :parameters (?robot - robot ?block - block)
    :precondition (holding ?robot ?block)
    :effect
      (and 
        (not (holding ?robot ?block))
        (clear ?block)
        (ontable ?block)
      )
  )

  (:action stack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (holding ?robot ?block1) 
      (clear ?block2)
      )
    :effect
      (and 
        (not (holding ?robot ?block1))
        (not (clear ?block2))
        (clear ?block1)
        (on ?block1 ?block2)
      )
  )

  (:action unstack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (on ?block1 ?block2) 
      (clear ?block1) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (holding ?robot ?block1)
        (clear ?block2)
        (not (clear ?block1))
        (not (on ?block2 ?block1))
      )
  )
)

; problem
(define (problem BLOCKS-6-2)
(:domain BLOCKS)
(:objects B E A C D F - block pr2 - robot)
(:INIT (CLEAR A) (ONTABLE C) (ON A D) (ON D B) (ON B F) (ON F E) (ON E C))
(:goal (AND (ON E F) (ON F A) (ON A B) (ON B C) (ON C D)))
)

; plan
1. (unstack pr2 a d)
   deleted: (clear a)
   added: (holding pr2 a) (clear d)
   goals met: 0 of 5
2. (unstack pr2 d b)
   deleted: (clear d)
   added: (holding pr2 d) (clear b)
   goals met: 0 of 5
3. (put-down pr2 d)
   deleted: (holding pr2 d)
   added: (clear d) (ontable d)
   goals met: 0 of 5
4. (stack pr2 a b)
   deleted: (holding pr2 a) (clear b)
   added: (clear a) (on a b)
   goals met: 1 of 5
5. (unstack pr2 d b)
   deleted: (clear d)
   added: (holding pr2 d) (clear b)
   goals met: 1 of 5
6. (unstack pr2 b f)
   deleted: (clear b)
   added: (holding pr2 b) (clear f)
   goals met: 1 of 5
7. (put-down pr2 d)
   deleted: (holding pr2 d)
   added: (clear d)
   goals met: 1 of 5
8. (unstack pr2 f e)
   deleted: (clear f)
   added: (holding pr2 f) (clear e)
   goals met: 1 of 5
9. (stack pr2 f a)
   deleted: (holding pr2 f) (clear a)
   added: (clear f) (on f a)
   goals met: 2 of 5
10. (unstack pr2 e c)
   deleted: (clear e)
   added: (holding pr2 e) (clear c)
   goals met: 2 of 5
11. (stack pr2 e f)
   deleted: (holding pr2 e) (clear f)
   added: (clear e) (on e f)
   goals met: 3 of 5
12. (pick-up pr2 c)
   deleted: (ontable c) (clear c)
   added: (holding pr2 c)
   goals met: 3 of 5
13. (stack pr2 c d)
   deleted: (holding pr2 c) (clear d)
   added: (clear c) (on c d)
   goals met: 4 of 5
14. (stack pr2 b c)
   deleted: (holding pr2 b) (clear c)
   added: (clear b) (on b c)
   goals met: 5 of 5
